In [60]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [61]:
df = pd.read_csv("data//titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [63]:
inputs = df.drop(['Survived'], axis = 'columns')
target = df.Survived

In [64]:
dummies = pd.get_dummies(df.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [65]:
df1 = pd.concat([inputs, dummies], axis = 'columns')
df1

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [66]:
df1.drop(['Sex','male'],axis='columns',inplace=True)
df1.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [67]:
df1.columns[df1.isna().any()]

Index(['Age'], dtype='object')

In [68]:
df1.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [69]:
df1.Age = df1.Age.fillna(df1.Age.mean())
df1.head(10)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0
8       3  27.000000  11.1333       1
9       2  14.000000  30.0708       1

In [70]:
x_train,x_test,y_train,y_test = train_test_split(df1, target, test_size = 0.3)

In [80]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [81]:
model.fit(x_train, y_train)

GaussianNB()

In [82]:
model.score(x_test, y_test)

0.7686567164179104

In [83]:
x_test[0:10]

     Pclass        Age      Fare  female
23        1  28.000000   35.5000       0
90        3  29.000000    8.0500       0
238       2  19.000000   10.5000       0
600       2  24.000000   27.0000       1
404       3  20.000000    8.6625       1
150       2  51.000000   12.5250       0
280       3  65.000000    7.7500       0
373       1  22.000000  135.6333       0
876       3  20.000000    9.8458       0
409       3  29.699118   25.4667       1

In [84]:
y_test[0:10]

23     1
90     0
238    0
600    1
404    0
150    0
280    0
373    0
876    0
409    0
Name: Survived, dtype: int64

In [85]:
model.predict(x_test[:10])

array([0, 0, 0, 1, 1, 0, 0, 1, 0, 0], dtype=int64)

In [86]:
model.predict_proba(x_test[:10])

array([[0.7168584 , 0.2831416 ],
       [0.96474676, 0.03525324],
       [0.91489783, 0.08510217],
       [0.31498238, 0.68501762],
       [0.49616281, 0.50383719],
       [0.92208478, 0.07791522],
       [0.94775987, 0.05224013],
       [0.00598413, 0.99401587],
       [0.96010531, 0.03989469],
       [0.52401104, 0.47598896]])

In [89]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),x_train, y_train, cv=5)

array([0.736     , 0.704     , 0.72      , 0.80645161, 0.82258065])